# RbsAdjustableConnector Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsAdjustableConnector Property
ParameterTypeId Class See Also
---
"Allow Slope Adjustments"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsAdjustableConnector { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsAdjustableConnector As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsAdjustableConnector {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace